clc;clear;close all
%--------------------------------------------------------------------------
%%
%model ciągły
A = [-0.9146 0 0.0405;
    0.1665 -0.1353 0.0058;
    0 0 -0.1353];
B = [0.0544 -0.0757;
    0.0053 0.1477;
    0.8647 0];
C = [0.3 0.01 -0.05;
    0.1 0.2 -0.05];
D = zeros(size(C,1),size(B,2));

nx = size(A,1);
ny = size(C,1);
nu = size(B,2);
%--------------------------------------------------------------------------

%model dyskretny
Ts = 0.1;
sys = ss(A,B,C,D);
sysd = c2d(sys,Ts,'zoh');
[Ad,Bd,Cd,Dd] = ssdata(sysd);
%--------------------------------------------------------------------------

%%
%parametry
nc = 4;
npred = 20;
na = 10;
Q = 700*C'*C;
R = eye(size(B,2));
%--------------------------------------------------------------------------

%%
%Ograniczenia
umax = 13*ones(size(Bd,2),1);
umin = -10*ones(size(Bd,2),1);
xmax = [5;5;5];
xmin = [-13.5;-13.5;-13];
ymax = 2*ones(size(Cd,1),1);
ymin = -0.1*ones(size(Cd,1),1);
%--------------------------------------------------------------------------

%%
%wygeneruj dane do regulatora
% [K,Sx,Sxc,Sxr,Sc,Sr,Scr] = ompc_cost_tracking(A,B,C,Q,R,nc,na);
[K,Sx,Sxc,Sc] = ompc_cost(Ad,Bd,Q,R,nc);
%--------------------------------------------------------------------------

%%
%Obserwator
sys_closed = ss(Ad-Bd*K,Bd,Cd,Dd,0.05);
poles = pole(sys_closed);

G = place(Ad',Cd',poles*0.2);
G = G';
%--------------------------------------------------------------------------